# Preflight

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Web browser

cask 'finicky'
cask 'firefox'
cask 'brave-browser'
tap 'browsh-org/homebrew-browsh'
brew 'browsh'

# Chat

cask 'discord'
cask 'slack'

# Environment-related

cask 'raycast'
cask 'karabiner-elements'
cask 'rescuetime'
brew 'wallpaper'

# Terminals

cask 'tabby'

# Tmux is a newer terminal multiplexer.
brew 'pkg-config', link: true
brew 'tmux'
brew 'reattach-to-user-namespace'

# Shells

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'starship'
brew 'coreutils'
brew 'bat'
brew 'less'
brew 'most'
brew 'delta'
brew 'wdiff'
brew 'exa'
brew 'difftastic'
brew 'tree'
brew 'fd'
brew 'pcre'
brew 'pcre++'
brew 'fzf'
brew 'zoxide'
brew 'watch'
brew 'gnu-which'
brew 'gpg'
brew 'curl', link: true
brew 'wget'
brew 'ed'
brew 'gnu-sed'
brew 'gawk'
brew 'grep'
brew 'ripgrep'
brew 'jq'
brew 'fx'
brew 'yq'
brew 'yh'
brew 'unzip'
brew 'gzip'
brew 'gpatch'
brew 'make'
brew 'automake'
brew 'gdb'  # gdb requires further actions to make it work. See `brew info gdb`.
brew 'openssl'
brew 'readline'
brew 'rlwrap'
brew 'base64'
brew 'translate-shell'
brew 'jrnl'

# Helpers

tap 'denisidoro/tools'
brew 'denisidoro/tools/navi'
brew 'tldr'
brew 'howdoi'

# Git

brew 'git'
brew 'git-lfs'
brew 'git-ftp'
brew 'git-delta'
brew 'gh'
brew 'hub'

cask 'gitup'
cask 'github'

# Editors

brew 'vim'
cask 'visual-studio-code'
cask 'typora'

# Ops

brew 'docker'
cask 'virtualbox'
brew 'google-cloud-sdk'
tap 'heroku/brew'
brew 'heroku'
cask 'osxfuse'
tap 'datawire/blackbird'
brew 'datawire/blackbird/telepresence'
cask 'proxyman'
cask 'insomnia'
brew 'tcl-tk'
brew 'kubectl'
brew 'minikube'
brew 'kubernetes-cli'
brew 'kube-ps1'
brew 'terraform'

# Database

tap 'mongodb/brew'
brew 'mongodb-community'
cask 'mongodb-compass-isolated-edition'
brew 'mongosh'

# Fonts

brew 'fontconfig'
brew 'freetype'

# Langs

brew 'gcc'

brew 'go'

brew 'openjdk'

brew 'ghc'
brew 'cabal-install'

brew 'node'
brew 'nvm'
tap 'egoist/tap'
brew 'egoist/tap/dum'

brew 'python3'
brew 'pyenv'
brew 'pyenv-virtualenv'

brew 'ruby'
brew 'ruby-install'

brew 'rust'
brew 'rustup-init'

brew 'jupyterlab'

# Linters

brew 'pandoc', link: true
brew 'shellcheck'
brew 'hadolint'
brew 'prettier'

# Android
cask 'android-studio'
cask 'android-file-transfer'
cask 'android-messages'
cask 'android-ndk'
cask 'android-platform-tools'
cask 'android-sdk'

# Selenium
brew 'selenium-server'
cask 'chromedriver'
brew 'geckodriver'
